"""
演示對序列進行切片操作
"""

# 對 list 進行切片，從1開始、4結束，步長1

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
list_result = my_list[1:4] #從 1 開始， 4 結束(不含 4 本身)，因為步常為 1 所以可以省略不用寫，再透過新容器接收
print(f"list 切片結果是: {list_result}")
"""
切片結果是: [2, 3, 4]
"""

# 對 tuple 進行切片，從頭開始，到最後結束，步長1
my_tuple_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
tuple_result = my_tuple_list[:] # 空格默認值從頭開始，到最後結束，步長1 也是默認值，所以這邊可以寫一個冒號，再透過新容器接收
print(f"tuple 切片結果是: {tuple_result}")
"""
tuple 切片結果是: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
"""

# 對str進行切片，從頭開始，到最後結束，步長-1
my_str_list = "0123456789"
str_result = my_str_list[::-1] # 空格默認值從頭開始，到最後結束，步長 -1 所以需加入:-1，所以這邊可以寫一個冒號，再透過新容器接收
print(f"str 切片結果是: {str_result}")
"""
str 切片結果是: 9876543210
"""

# 對列表進行切片，從3開始，到1結束，步長-1
my_list = [1,2,3,4,5,6,7,8,9,10]
# index：  0 1 2 3 4 5 6 7 8  9
list_result = my_list[3:1:-1] # 起始從 index 3 開始，到結尾以 1 結束，步長-1，再透過新容器接收
print(f"list 切片結果是: {list_result}")
"""
list 切片結果是: [4, 3]
"""
# 對元組進行切片，從頭到尾結束，步長-2
my_tuple = (0,1,2,3,4,5,6,7,8,9,10,11,12)
tuple_result_2 = my_tuple[::-2]  # 空格默認值從頭開始，到最後結束，步長-2，再透過新容器接收
print(f"tuple(元組) 切片結果是: {tuple_result_2}")
"""
tuple(元組) 切片結果是: (12, 10, 8, 6, 4, 2, 0)
"""