"""
tuple 定義與操作
"""
from operator import index

# 定義元組
t1 = (1, 2, 3)
# 定義空元組
t2 = ()
t3 = tuple()

print(f"t1的類型是: {type(t1)}，內容是: {t1}")
print(f"t2的類型是: {type(t2)}，內容是: {t2}")
print(f"t3的類型是: {type(t3)}，內容是: {t3}")
"""
t1的類型是: <class 'tuple'>，內容是: (1, 2, 3)
t2的類型是: <class 'tuple'>，內容是: ()
t3的類型是: <class 'tuple'>，內容是: ()
"""
# 定義單個元素的元素，必須加上逗號，否則不是元組
t4 = (1,)
t5  = (1)

print(f"t4的類型是: {type(t4)}，內容是: {t4}")
print(f"t5的類型是: {type(t5)}，內容是: {t5}")
"""

t4的類型是: <class 'tuple'>，內容是: (1,)
t5的類型是: <class 'int'>，內容是: 1
"""
# 元素的嵌套
t6 = ((1,2,3),(4,5,6))
print(f"t6的類型是: {type(t6)}，內容是: {t6}")
"""
t6的類型是: <class 'tuple'>，內容是: ((1, 2, 3), (4, 5, 6))
"""
# 下標索引取出元素
t6 = ((1,2,3),(4,5,6))
print(f"我要取出第二個的數字{t6[1][2]}，結果是:t6[1][2] ")
"""
我要取出第二個的數字6，結果是:t6[1][2] 
"""
# 元素的操作:index 查找方法
t1 = (1, 2, 3)
print(f"透過 index() 的方法中可以知道數字2的下標為:{t1.index(2)}") # 1
"""
透過 index的方法中可以知道數字2的下標為:1
"""
#  元素的操作:count 的統計方法
t1 = (1, 2, 3,6,2,7,8,2)
print(f"透過 count() 的方法中可以知道數字2的出現次數為:{t1.count(2)}") # 3
"""
透過 count() 的方法中可以知道數字2的出現次數為:3
"""

#  元素的操作: len 函數統計元組元素數量
t1 = (1, 2, 3,6,2,7,8,2)
print(f"透過 len() 的方法中可以知道元組中的元素總共有:{len(t1)}") # 8
"""
透過 len() 的方法中可以知道元組中的元素總共有:8
"""
# 元組遍例 while
index = 0 # 初始化
while index < len(t1):
    print(f"元組的元素有:{t1[index]}")
    index += 1

"""
元組的元素有:1
元組的元素有:2
元組的元素有:3
元組的元素有:6
元組的元素有:2
元組的元素有:7
元組的元素有:8
元組的元素有:2

"""

# 元組遍例 for
for element in t1:
    print(f"(for)元組的元素有:{element}")

"""
(for)元組的元素有:1
(for)元組的元素有:2
(for)元組的元素有:3
(for)元組的元素有:6
(for)元組的元素有:2
(for)元組的元素有:7
(for)元組的元素有:8
(for)元組的元素有:2
"""

# 元素修改
"""
t7 = (1,2,3)
t7[0] = 5   # 元組不可修改
"""

# 特例:元素中列表
t8 = (1,2,['hi','QaQ','UAU'])
t8[2][1] = 'QAQ'
print(t8)
# (1, 2, ['hi', 'QAQ', 'UAU'])