"""
如有底下員工訊息，使用字典完成數據紀錄
並透過for循環，對所有級別為1級的員工，級別上升1級，薪水加1000元

"""

AllMember = {
    "小新": {
        "部門": "春日部",
        "薪水": 30000,
        "等級": 1
    },
    "美冴": {
        "部門": "家庭主婦部",
        "薪水": 50000,
        "等級": 2
    },
    "廣志": {
        "部門": "雙葉商事",
        "薪水": 50000,
        "等級": 2
    },
    "妮妮": {
        "部門": "幼稚園紅組",
        "薪水": 60000,
        "等級": 3
    }
}

print(f"全體員工訊息如下:{AllMember}")

# 並透過for循環，對所有級別為1級的員工，級別上升1級，薪水加1000元
for member in AllMember.keys():
    if AllMember[member]["等級"] == 1:
        AllMember[member]["薪水"] += 1000
        AllMember[member]["等級"] += 1
print(f"升等後全體員工訊息如下:{AllMember}")
