"""
通過 while循環輸出九九乘法表
"""
# 定義一個 i 作為外層循環，控制總共有幾行
# i = 1 # 從1開始!
# while i <= 9:
#
#     # 定義內層循環控制變量
#     j = 1
#     while j <= i:
#         # 內層循環 print 語句不換行!
#         print(f"{i} * {j} = { i * j }\t",end='')
#         j += 1
#     i += 1
#     print() # 輸出一個換行


# 親自寫一遍，沒提示

# 設定跑外層的變數
i = 9 # 從第一行開始
# 進入 While 迴圈
while i >= 1:

    # 設定內層迴圈的變量，控制 乘數
    j = 1 # 乘數皆是從 9 開始
    # 進入內層 While 迴圈
    while j <= i: # 當外層跑到第幾行就與他比較
        print(f"{i}*{j}={i * j}\t",end='')
        j += 1
    i -= 1
    print()